benchmarks/results/20260724_203009/nginx_proxy_c500.txt
Running 15s test @ http://127.0.0.1:18081/proxy/
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   620.26ms  242.68ms   1.96s    75.06%
    Req/Sec   173.78    121.19   752.00     69.03%
  Latency Distribution
     50%  608.31ms
     75%  727.53ms
     90%  897.84ms
     99%    1.39s 
  10257 requests in 15.04s, 1.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 266
Requests/sec:    682.08
Transfer/sec:    128.56KB