benchmarks/results/20260724_203009/pingclair_proxy_c50.txt
Running 15s test @ http://127.0.0.1:18080/proxy/
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.91ms    5.76ms 202.53ms   99.48%
    Req/Sec     7.36k     0.86k   10.28k    78.50%
  Latency Distribution
     50%    1.49ms
     75%    2.00ms
     90%    2.34ms
     99%    3.29ms
  439374 requests in 15.01s, 94.70MB read
Requests/sec:  29268.19
Transfer/sec:      6.31MB